; domain
(define (domain gripper-typed)
   (:requirements :typing)
   (:types room ball gripper)
   (:constants left right - gripper)
   (:predicates (at-robby ?dummy - room ?r - room)
		(at ?dummy - ball ?b - ball ?r - room)
		(free ?dummy - gripper ?g - gripper)
		(carry ?dummy - ball ?o - ball ?g - gripper))

   (:action move
       :parameters  (?from ?to - room)
       :precondition (at-robby ?from ?from)
       :effect (and  (at-robby ?to ?to)
		     (not (at-robby ?from ?from))))



   (:action pick
       :parameters (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (at ?obj ?obj ?room) (at-robby ?room ?room) (free ?gripper ?gripper))
       :effect (and (carry ?obj ?obj ?gripper)
		    (not (at ?obj ?obj ?room))
		    (not (free ?gripper ?gripper))))


   (:action drop
       :parameters  (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (carry ?obj ?obj ?gripper) (at-robby ?room ?room))
       :effect (and (at ?obj ?obj ?room)
		    (free ?gripper ?gripper)
		    (not (carry ?obj ?obj ?gripper)))))

; problem
(define (problem gripper-x-17)
   (:domain gripper-typed)
   (:objects rooma roomb - room
             ball36 ball35 ball34 ball33 ball32 ball31 ball30 ball29 ball28
             ball27 ball26 ball25 ball24 ball23 ball22 ball21 ball20 ball19
             ball18 ball17 ball16 ball15 ball14 ball13 ball12 ball11 ball10
             ball9 ball8 ball7 ball6 ball5 ball4 ball3 ball2 ball1 - ball)
   (:init (at-robby rooma rooma)
          (free left left)
          (free right right)
          (at ball36 ball36 rooma)
          (at ball35 ball35 rooma)
          (at ball34 ball34 rooma)
          (at ball33 ball33 rooma)
          (at ball32 ball32 rooma)
          (at ball31 ball31 rooma)
          (at ball30 ball30 rooma)
          (at ball29 ball29 rooma)
          (at ball28 ball28 rooma)
          (at ball27 ball27 rooma)
          (at ball26 ball26 rooma)
          (at ball25 ball25 rooma)
          (at ball24 ball24 rooma)
          (at ball23 ball23 rooma)
          (at ball22 ball22 rooma)
          (at ball21 ball21 rooma)
          (at ball20 ball20 rooma)
          (at ball19 ball19 rooma)
          (at ball18 ball18 rooma)
          (at ball17 ball17 rooma)
          (at ball16 ball16 rooma)
          (at ball15 ball15 rooma)
          (at ball14 ball14 rooma)
          (at ball13 ball13 rooma)
          (at ball12 ball12 rooma)
          (at ball11 ball11 rooma)
          (at ball10 ball10 rooma)
          (at ball9 ball9 rooma)
          (at ball8 ball8 rooma)
          (at ball7 ball7 rooma)
          (at ball6 ball6 rooma)
          (at ball5 ball5 rooma)
          (at ball4 ball4 rooma)
          (at ball3 ball3 rooma)
          (at ball2 ball2 rooma)
          (at ball1 ball1 rooma))
   (:goal (and (at ball36 ball36 roomb)
               (at ball35 ball35 roomb)
               (at ball34 ball34 roomb)
               (at ball33 ball33 roomb)
               (at ball32 ball32 roomb)
               (at ball31 ball31 roomb)
               (at ball30 ball30 roomb)
               (at ball29 ball29 roomb)
               (at ball28 ball28 roomb)
               (at ball27 ball27 roomb)
               (at ball26 ball26 roomb)
               (at ball25 ball25 roomb)
               (at ball24 ball24 roomb)
               (at ball23 ball23 roomb)
               (at ball22 ball22 roomb)
               (at ball21 ball21 roomb)
               (at ball20 ball20 roomb)
               (at ball19 ball19 roomb)
               (at ball18 ball18 roomb)
               (at ball17 ball17 roomb)
               (at ball16 ball16 roomb)
               (at ball15 ball15 roomb)
               (at ball14 ball14 roomb)
               (at ball13 ball13 roomb)
               (at ball12 ball12 roomb)
               (at ball11 ball11 roomb)
               (at ball10 ball10 roomb)
               (at ball9 ball9 roomb)
               (at ball8 ball8 roomb)
               (at ball7 ball7 roomb)
               (at ball6 ball6 roomb)
               (at ball5 ball5 roomb)
               (at ball4 ball4 roomb)
               (at ball3 ball3 roomb)
               (at ball2 ball2 roomb)
               (at ball1 ball1 roomb))))

; plan
1. (pick ball1 rooma left)
   deleted: (at ball1 ball1 rooma) (free left left)
   added: (carry ball1 ball1 left)
   goals met: 0 of 36
2. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 0 of 36
3. (drop ball1 roomb left)
   deleted: (carry ball1 ball1 left)
   added: (at ball1 ball1 roomb) (free left left)
   goals met: 1 of 36
4. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 1 of 36
5. (pick ball10 rooma left)
   deleted: (at ball10 ball10 rooma) (free left left)
   added: (carry ball10 ball10 left)
   goals met: 1 of 36
6. (pick ball11 rooma right)
   deleted: (at ball11 ball11 rooma) (free right right)
   added: (carry ball11 ball11 right)
   goals met: 1 of 36
7. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 1 of 36
8. (drop ball10 roomb left)
   deleted: (carry ball10 ball10 left)
   added: (at ball10 ball10 roomb) (free left left)
   goals met: 2 of 36
9. (drop ball11 roomb right)
   deleted: (carry ball11 ball11 right)
   added: (at ball11 ball11 roomb) (free right right)
   goals met: 3 of 36
10. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 3 of 36
11. (pick ball12 rooma left)
   deleted: (at ball12 ball12 rooma) (free left left)
   added: (carry ball12 ball12 left)
   goals met: 3 of 36
12. (pick ball13 rooma right)
   deleted: (at ball13 ball13 rooma) (free right right)
   added: (carry ball13 ball13 right)
   goals met: 3 of 36
13. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 3 of 36
14. (drop ball12 roomb left)
   deleted: (carry ball12 ball12 left)
   added: (at ball12 ball12 roomb) (free left left)
   goals met: 4 of 36
15. (drop ball13 roomb right)
   deleted: (carry ball13 ball13 right)
   added: (at ball13 ball13 roomb) (free right right)
   goals met: 5 of 36
16. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 5 of 36
17. (pick ball14 rooma left)
   deleted: (at ball14 ball14 rooma) (free left left)
   added: (carry ball14 ball14 left)
   goals met: 5 of 36
18. (pick ball15 rooma right)
   deleted: (at ball15 ball15 rooma) (free right right)
   added: (carry ball15 ball15 right)
   goals met: 5 of 36
19. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 5 of 36
20. (drop ball14 roomb left)
   deleted: (carry ball14 ball14 left)
   added: (at ball14 ball14 roomb) (free left left)
   goals met: 6 of 36
21. (drop ball15 roomb right)
   deleted: (carry ball15 ball15 right)
   added: (at ball15 ball15 roomb) (free right right)
   goals met: 7 of 36
22. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 7 of 36
23. (pick ball16 rooma left)
   deleted: (at ball16 ball16 rooma) (free left left)
   added: (carry ball16 ball16 left)
   goals met: 7 of 36
24. (pick ball17 rooma right)
   deleted: (at ball17 ball17 rooma) (free right right)
   added: (carry ball17 ball17 right)
   goals met: 7 of 36
25. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 7 of 36
26. (drop ball16 roomb left)
   deleted: (carry ball16 ball16 left)
   added: (at ball16 ball16 roomb) (free left left)
   goals met: 8 of 36
27. (drop ball17 roomb right)
   deleted: (carry ball17 ball17 right)
   added: (at ball17 ball17 roomb) (free right right)
   goals met: 9 of 36
28. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 9 of 36
29. (pick ball18 rooma left)
   deleted: (at ball18 ball18 rooma) (free left left)
   added: (carry ball18 ball18 left)
   goals met: 9 of 36
30. (pick ball19 rooma right)
   deleted: (at ball19 ball19 rooma) (free right right)
   added: (carry ball19 ball19 right)
   goals met: 9 of 36
31. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 9 of 36
32. (drop ball18 roomb left)
   deleted: (carry ball18 ball18 left)
   added: (at ball18 ball18 roomb) (free left left)
   goals met: 10 of 36
33. (drop ball19 roomb right)
   deleted: (carry ball19 ball19 right)
   added: (at ball19 ball19 roomb) (free right right)
   goals met: 11 of 36
34. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 11 of 36
35. (pick ball2 rooma left)
   deleted: (at ball2 ball2 rooma) (free left left)
   added: (carry ball2 ball2 left)
   goals met: 11 of 36
36. (pick ball20 rooma right)
   deleted: (at ball20 ball20 rooma) (free right right)
   added: (carry ball20 ball20 right)
   goals met: 11 of 36
37. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 11 of 36
38. (drop ball2 roomb left)
   deleted: (carry ball2 ball2 left)
   added: (at ball2 ball2 roomb) (free left left)
   goals met: 12 of 36
39. (drop ball20 roomb right)
   deleted: (carry ball20 ball20 right)
   added: (at ball20 ball20 roomb) (free right right)
   goals met: 13 of 36
40. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 13 of 36
41. (pick ball21 rooma left)
   deleted: (at ball21 ball21 rooma) (free left left)
   added: (carry ball21 ball21 left)
   goals met: 13 of 36
42. (pick ball22 rooma right)
   deleted: (at ball22 ball22 rooma) (free right right)
   added: (carry ball22 ball22 right)
   goals met: 13 of 36
43. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 13 of 36
44. (drop ball21 roomb left)
   deleted: (carry ball21 ball21 left)
   added: (at ball21 ball21 roomb) (free left left)
   goals met: 14 of 36
45. (drop ball22 roomb right)
   deleted: (carry ball22 ball22 right)
   added: (at ball22 ball22 roomb) (free right right)
   goals met: 15 of 36
46. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 15 of 36
47. (pick ball23 rooma left)
   deleted: (at ball23 ball23 rooma) (free left left)
   added: (carry ball23 ball23 left)
   goals met: 15 of 36
48. (pick ball24 rooma right)
   deleted: (at ball24 ball24 rooma) (free right right)
   added: (carry ball24 ball24 right)
   goals met: 15 of 36
49. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 15 of 36
50. (drop ball23 roomb left)
   deleted: (carry ball23 ball23 left)
   added: (at ball23 ball23 roomb) (free left left)
   goals met: 16 of 36
51. (drop ball24 roomb right)
   deleted: (carry ball24 ball24 right)
   added: (at ball24 ball24 roomb) (free right right)
   goals met: 17 of 36
52. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 17 of 36
53. (pick ball25 rooma left)
   deleted: (at ball25 ball25 rooma) (free left left)
   added: (carry ball25 ball25 left)
   goals met: 17 of 36
54. (pick ball26 rooma right)
   deleted: (at ball26 ball26 rooma) (free right right)
   added: (carry ball26 ball26 right)
   goals met: 17 of 36
55. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 17 of 36
56. (drop ball25 roomb left)
   deleted: (carry ball25 ball25 left)
   added: (at ball25 ball25 roomb) (free left left)
   goals met: 18 of 36
57. (drop ball26 roomb right)
   deleted: (carry ball26 ball26 right)
   added: (at ball26 ball26 roomb) (free right right)
   goals met: 19 of 36
58. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 19 of 36
59. (pick ball27 rooma left)
   deleted: (at ball27 ball27 rooma) (free left left)
   added: (carry ball27 ball27 left)
   goals met: 19 of 36
60. (pick ball28 rooma right)
   deleted: (at ball28 ball28 rooma) (free right right)
   added: (carry ball28 ball28 right)
   goals met: 19 of 36
61. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 19 of 36
62. (drop ball27 roomb left)
   deleted: (carry ball27 ball27 left)
   added: (at ball27 ball27 roomb) (free left left)
   goals met: 20 of 36
63. (drop ball28 roomb right)
   deleted: (carry ball28 ball28 right)
   added: (at ball28 ball28 roomb) (free right right)
   goals met: 21 of 36
64. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 21 of 36
65. (pick ball29 rooma left)
   deleted: (at ball29 ball29 rooma) (free left left)
   added: (carry ball29 ball29 left)
   goals met: 21 of 36
66. (pick ball3 rooma right)
   deleted: (at ball3 ball3 rooma) (free right right)
   added: (carry ball3 ball3 right)
   goals met: 21 of 36
67. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 21 of 36
68. (drop ball29 roomb left)
   deleted: (carry ball29 ball29 left)
   added: (at ball29 ball29 roomb) (free left left)
   goals met: 22 of 36
69. (drop ball3 roomb right)
   deleted: (carry ball3 ball3 right)
   added: (at ball3 ball3 roomb) (free right right)
   goals met: 23 of 36
70. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 23 of 36
71. (pick ball30 rooma left)
   deleted: (at ball30 ball30 rooma) (free left left)
   added: (carry ball30 ball30 left)
   goals met: 23 of 36
72. (pick ball31 rooma right)
   deleted: (at ball31 ball31 rooma) (free right right)
   added: (carry ball31 ball31 right)
   goals met: 23 of 36
73. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 23 of 36
74. (drop ball30 roomb left)
   deleted: (carry ball30 ball30 left)
   added: (at ball30 ball30 roomb) (free left left)
   goals met: 24 of 36
75. (drop ball31 roomb right)
   deleted: (carry ball31 ball31 right)
   added: (at ball31 ball31 roomb) (free right right)
   goals met: 25 of 36
76. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 25 of 36
77. (pick ball32 rooma left)
   deleted: (at ball32 ball32 rooma) (free left left)
   added: (carry ball32 ball32 left)
   goals met: 25 of 36
78. (pick ball33 rooma right)
   deleted: (at ball33 ball33 rooma) (free right right)
   added: (carry ball33 ball33 right)
   goals met: 25 of 36
79. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 25 of 36
80. (drop ball32 roomb left)
   deleted: (carry ball32 ball32 left)
   added: (at ball32 ball32 roomb) (free left left)
   goals met: 26 of 36
81. (drop ball33 roomb right)
   deleted: (carry ball33 ball33 right)
   added: (at ball33 ball33 roomb) (free right right)
   goals met: 27 of 36
82. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 27 of 36
83. (pick ball34 rooma left)
   deleted: (at ball34 ball34 rooma) (free left left)
   added: (carry ball34 ball34 left)
   goals met: 27 of 36
84. (pick ball35 rooma right)
   deleted: (at ball35 ball35 rooma) (free right right)
   added: (carry ball35 ball35 right)
   goals met: 27 of 36
85. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 27 of 36
86. (drop ball34 roomb left)
   deleted: (carry ball34 ball34 left)
   added: (at ball34 ball34 roomb) (free left left)
   goals met: 28 of 36
87. (drop ball35 roomb right)
   deleted: (carry ball35 ball35 right)
   added: (at ball35 ball35 roomb) (free right right)
   goals met: 29 of 36
88. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 29 of 36
89. (pick ball36 rooma left)
   deleted: (at ball36 ball36 rooma) (free left left)
   added: (carry ball36 ball36 left)
   goals met: 29 of 36
90. (pick ball4 rooma right)
   deleted: (at ball4 ball4 rooma) (free right right)
   added: (carry ball4 ball4 right)
   goals met: 29 of 36
91. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 29 of 36
92. (drop ball36 roomb left)
   deleted: (carry ball36 ball36 left)
   added: (at ball36 ball36 roomb) (free left left)
   goals met: 30 of 36
93. (drop ball4 roomb right)
   deleted: (carry ball4 ball4 right)
   added: (at ball4 ball4 roomb) (free right right)
   goals met: 31 of 36
94. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 31 of 36
95. (pick ball5 rooma left)
   deleted: (at ball5 ball5 rooma) (free left left)
   added: (carry ball5 ball5 left)
   goals met: 31 of 36
96. (pick ball6 rooma right)
   deleted: (at ball6 ball6 rooma) (free right right)
   added: (carry ball6 ball6 right)
   goals met: 31 of 36
97. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 31 of 36
98. (drop ball5 roomb left)
   deleted: (carry ball5 ball5 left)
   added: (at ball5 ball5 roomb) (free left left)
   goals met: 32 of 36
99. (drop ball6 roomb right)
   deleted: (carry ball6 ball6 right)
   added: (at ball6 ball6 roomb) (free right right)
   goals met: 33 of 36
100. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 33 of 36
101. (pick ball7 rooma left)
   deleted: (at ball7 ball7 rooma) (free left left)
   added: (carry ball7 ball7 left)
   goals met: 33 of 36
102. (pick ball8 rooma right)
   deleted: (at ball8 ball8 rooma) (free right right)
   added: (carry ball8 ball8 right)
   goals met: 33 of 36
103. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 33 of 36
104. (drop ball7 roomb left)
   deleted: (carry ball7 ball7 left)
   added: (at ball7 ball7 roomb) (free left left)
   goals met: 34 of 36
105. (drop ball8 roomb right)
   deleted: (carry ball8 ball8 right)
   added: (at ball8 ball8 roomb) (free right right)
   goals met: 35 of 36
106. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 35 of 36
107. (pick ball9 rooma left)
   deleted: (at ball9 ball9 rooma) (free left left)
   added: (carry ball9 ball9 left)
   goals met: 35 of 36
108. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 35 of 36
109. (drop ball9 roomb left)
   deleted: (carry ball9 ball9 left)
   added: (at ball9 ball9 roomb) (free left left)
   goals met: 36 of 36
